On Google Chrome.
Chrome dev tools. 
CTRL + SHIFT + I

In [1]:
#pip install beautifulsoup4

In [2]:
import requests
from bs4 import BeautifulSoup

In [3]:
#download the webpage
url = "https://www.caranddriver.com/es/coches/planeta-motor/g37318039/coches-consumen-menos-combustible/"
page = requests.get(url)

In [4]:
response = requests.get(url)
response.status_code

200

In [5]:
#parse the html
soup = BeautifulSoup(response.content,'html.parser')

In [6]:
# print the formatted html
#soup.select("#main-content")

In [7]:
len(soup.select("div > div > div > h2"))

20

In [8]:
soup.select("div > div > div > h2")[2].get_text()

'Mazda 2 (gasolina)'

In [9]:
soup.select("div > div > div > h2")[19].get_text()

'BMW Serie 2 Active Tourer (PHEV)'

In [10]:
car_models = []
for i in range(len(soup.select("div > div > div > h2"))):
    car_models.append(soup.select("div > div > div > h2")[i].get_text())

print(car_models)

['Toyota Aygo X Cross (gasolina)', 'Suzuki Swift (gasolina)', 'Mazda 2 (gasolina)', 'Fiat 500 Hybrid (gasolina)', 'Mazda 3 Sedán (gasolina)', 'Toyota Yaris Cross (híbrido)', 'Kia Niro (Híbrido)', 'Toyota Corolla (Híbrido)', 'Skoda Octavia (diésel)', 'Volkswagen Golf (diésel)', 'Audi A3 Sedán (diésel)', 'Peugeot 208 (diésel)', 'Renault Clio (diésel)', 'Toyota Yaris (híbrido)', 'Mazda 2 Hybrid (híbrido)', 'Range Rover Sport (PHEV)', 'Mercedes GLE (PHEV)', 'Volvo S60 (PHEV)', 'Mercedes Clase S (PHEV)', 'BMW Serie 2 Active Tourer (PHEV)']

In [11]:
#texts = soup.select(" div > div > div > div > div > p")
#texts

In [12]:
soup.select("div > div > div > div > div > p")[0].get_text()

'Ha sido el último en llegar y ha estado a punto de colocarse como el modelo de gasolina más eficiente, por lo que el Toyota Aygo X Cross se tendrá que conformar con la segunda posición del ranking. Esto es así porque su motor atmosférico de tres cilindros y 72 caballos de potencia necesita de 4,8 litros para recorrer 100 kilómetros. ¿Quién se habrá posicionado por delante suya?'

In [13]:
car_description = []

for i in range(len(soup.select("div > div > div > h2"))):
    car_description.append(soup.select("div > div > div > div > div > p")[i].get_text())

car_description[6]

'El Kia Niro es una opción interesante para aquellos que busquen un vehículo más amplio que permita realizar viajes en familia y con un consumo de combustible ajustado, como así anuncian los 4,4 litros por cada 100 kilómetros que homologa esta versión híbrida de la nueva generación. El sistema híbrido desarrolla 141 caballos de potencia y un par máximo de 265 Nm, asociado a una caja de cambios automática de doble embrague y seis velocidades.'

In [14]:
import pandas as pd
sc_df = pd.DataFrame({'Car model':car_models,'Description':car_description})
sc_df

,Car model,Description
0,Toyota Aygo X Cross (gasolina),Ha sido el último en llegar y ha estado a punt...
1,Suzuki Swift (gasolina),Uno de los modelos más eficientes de su catego...
2,Mazda 2 (gasolina),El tercer coche de gasolina más eficiente de n...
3,Fiat 500 Hybrid (gasolina),El título del segundo automóvil alimentado por...
4,Mazda 3 Sedán (gasolina),El rey de la eficiencia de los motores de gaso...
5,Toyota Yaris Cross (híbrido),La buena aceptación que está teniendo el Toyot...
6,Kia Niro (Híbrido),El Kia Niro es una opción interesante para aqu...
7,Toyota Corolla (Híbrido),El pasado año se coló entre los 10 coches más ...
8,Skoda Octavia (diésel),El modelo checo no solo es uno de los más cómo...
9,Volkswagen Golf (diésel),El popular compacto alemán no quería perderse ...
10,Audi A3 Sedán (diésel),El Audi A3 Sedan recurre al mismo bloque de 2....
11,Peugeot 208 (diésel),El Grupo Stellantis también mantiene su apuest...
12,Renault Clio (diésel),Es uno de los utilitarios más populares del me...
13,Toyota Yaris (híbrido),Hablar de utilitarios híbridos en España es si...
14,Mazda 2 Hybrid (híbrido),El utilitario japonés repite en esta clasifica...
15,Range Rover Sport (PHEV),La nueva generación del Range Rover Sport apor...
16,Mercedes GLE (PHEV),Se ha renovado recientemente y su gran enverga...
17,Volvo S60 (PHEV),La firma sueca ha apostado fuertemente por las...
18,Mercedes Clase S (PHEV),La última motorización en incorporarse a la ga...
19,BMW Serie 2 Active Tourer (PHEV),La nueva generación del BMW Serie 2 Active Tou...

In [15]:
sc_df = sc_df.drop([3, 4, 7, 10, 11, 15, 16, 18])

In [16]:
sc_df.reset_index(drop=True, inplace=True)

In [17]:
sc_df

,Car model,Description
0,Toyota Aygo X Cross (gasolina),Ha sido el último en llegar y ha estado a punt...
1,Suzuki Swift (gasolina),Uno de los modelos más eficientes de su catego...
2,Mazda 2 (gasolina),El tercer coche de gasolina más eficiente de n...
3,Toyota Yaris Cross (híbrido),La buena aceptación que está teniendo el Toyot...
4,Kia Niro (Híbrido),El Kia Niro es una opción interesante para aqu...
5,Skoda Octavia (diésel),El modelo checo no solo es uno de los más cómo...
6,Volkswagen Golf (diésel),El popular compacto alemán no quería perderse ...
7,Renault Clio (diésel),Es uno de los utilitarios más populares del me...
8,Toyota Yaris (híbrido),Hablar de utilitarios híbridos en España es si...
9,Mazda 2 Hybrid (híbrido),El utilitario japonés repite en esta clasifica...
10,Volvo S60 (PHEV),La firma sueca ha apostado fuertemente por las...
11,BMW Serie 2 Active Tourer (PHEV),La nueva generación del BMW Serie 2 Active Tou...

In [18]:
description_df = sc_df["Description"]

## Number Extraction.

In [19]:
# Regular expression to extract how many litres(litros) per 100km.

In [20]:
import re

In [21]:
text = sc_df["Description"][5] #en el 5,7,8,11 salen 2 números
# r"(\d+[\.,]\d+)\s*litros"
# r"(\d[\.,]\d)\s*litros"
pattern = r"(\d[\.,]?\d)\s*litros"
# ()  capturan el número antes de "caballos" como un grupo
# \d  coincide con cualquier dígito (0-9)
# [\.,]? ordena que tenga . o , in order to be decimal. Pero el ? permite que sea opcional. De este modo puedo usar la misma fórmula para los caballos también.
# \s* coincide con cero o más caracteres de espacio en blanco.
result = re.findall(pattern, text)

In [22]:
# Regular expression to extract how many CVs(caballos) has each car engine.

In [23]:
text = sc_df["Description"][5]
pattern = r"(\d+[\.,]?\d*)\s*caballos" 
#Here I need to add a "+" to get one more digit from the number. 
result = re.findall(pattern, text)
result

['116']

In [24]:
def extract_litros(text):
    pattern = r"(\d[\.,]?\d)\s*litros"
    result = re.findall(pattern, text)
    return result

In [25]:
texts = sc_df["Description"]

In [26]:
litres = []
for text in texts:
    litros = extract_litros(text)
    litres.append(litros)
print(litres)

[['4,8'], ['4,7'], ['4,7'], ['4,4'], ['4,4'], ['2.0', '4,2'], ['4,2'], ['1.5', '4,1'], ['3,9', '1.5'], ['3,8'], ['0,7'], ['1.5', '0,6']]

In [27]:
litres = pd.DataFrame(litres)
litres

      0     1
0   4,8  None
1   4,7  None
2   4,7  None
3   4,4  None
4   4,4  None
5   2.0   4,2
6   4,2  None
7   1.5   4,1
8   3,9   1.5
9   3,8  None
10  0,7  None
11  1.5   0,6

In [28]:
# Remove values in Column 2 that are smaller than Column 1
litres.loc[litres[1] < litres[0], 1] = float('nan')
# I am removing the smaller ones because they refer to another data, not l per 100km. 
litres

      0     1
0   4,8  None
1   4,7  None
2   4,7  None
3   4,4  None
4   4,4  None
5   2.0   4,2
6   4,2  None
7   1.5   4,1
8   3,9   NaN
9   3,8  None
10  0,7  None
11  1.5   NaN

In [29]:
# Check if both columns have non-null values.
check_Nvalues = litres[0].notnull() & litres[1].notnull()

In [30]:
# Switch values between Column 0 and Column 1 because the values left in the column 1 are higher.

litres.loc[check_Nvalues, [0, 1]] = litres.loc[check_Nvalues, [1, 0]].values

litres

      0     1
0   4,8  None
1   4,7  None
2   4,7  None
3   4,4  None
4   4,4  None
5   4,2   2.0
6   4,2  None
7   4,1   1.5
8   3,9   NaN
9   3,8  None
10  0,7  None
11  1.5   NaN

In [31]:
litres = litres.drop(1, axis=1)
# Rename the colum 0 per Lper100km.
litres

      0
0   4,8
1   4,7
2   4,7
3   4,4
4   4,4
5   4,2
6   4,2
7   4,1
8   3,9
9   3,8
10  0,7
11  1.5

In [32]:
litres = pd.DataFrame(litres)
#litres = litres.reset_index(drop=True, inplace=True)

In [33]:
litres = litres.rename(columns={0:'litres'})

In [34]:
litres

   litres
0     4,8
1     4,7
2     4,7
3     4,4
4     4,4
5     4,2
6     4,2
7     4,1
8     3,9
9     3,8
10    0,7
11    1.5

In [35]:
def extract_caballos(text): #Caballo/s means horse/s.
    pattern = r"(\d+[\.,]?\d*)\s*caballos"
    result = re.findall(pattern, text)
    return result

In [36]:
horsepower = []
for text in texts:
    caballo = extract_caballos(text)
    horsepower.append(caballo)
print(horsepower)

[['72'], ['83'], ['90'], ['116'], ['141'], ['116'], ['115'], ['100'], ['116'], ['116'], ['455'], ['245']]

In [37]:
horsepower = pd.DataFrame(horsepower)
#horsepower = horsepower.reset_index(drop=True, inplace=True)

In [38]:
horsepower = horsepower.rename(columns={0:'horsepower'})

In [39]:
horsepower

   horsepower
0          72
1          83
2          90
3         116
4         141
5         116
6         115
7         100
8         116
9         116
10        455
11        245

In [40]:
sc_columns = pd.concat([litres,horsepower], axis=1)

In [41]:
# I dón't need to use this one: sc_columns = pd.DataFrame(sc_columns)  
# because both dataset were already a datafrmae
sc_columns["Car model"] = sc_df["Car model"]

In [42]:
sc_columns

   litres horsepower                         Car model
0     4,8         72    Toyota Aygo X Cross (gasolina)
1     4,7         83           Suzuki Swift (gasolina)
2     4,7         90                Mazda 2 (gasolina)
3     4,4        116      Toyota Yaris Cross (híbrido)
4     4,4        141                Kia Niro (Híbrido)
5     4,2        116            Skoda Octavia (diésel)
6     4,2        115          Volkswagen Golf (diésel)
7     4,1        100             Renault Clio (diésel)
8     3,9        116            Toyota Yaris (híbrido)
9     3,8        116          Mazda 2 Hybrid (híbrido)
10    0,7        455                  Volvo S60 (PHEV)
11    1.5        245  BMW Serie 2 Active Tourer (PHEV)